app/Controllers/Admin_login.php

    public function index()
    {
        // $session = \Config\Services::session($config);
        $db = \Config\Database::connect();
        if (strtolower($this->request->getMethod()) !== 'post') {
            return view('Admin/Login');
        }

        $rules = [
            'username' => 'required',
            'password' => 'required',
        ];

        if (!$this->validate($rules)) {
            return view('Admin/Login');
        } else {

            $username = $this->request->getVar('username');
            $password = $this->request->getVar('password');
            $query = $db->table('admin')
                ->where('username', $username)
                ->get();
            // dd($query);
            $user = $query->getRow();
---
SELECT *
FROM `admin`
WHERE `username` = 'test@gmail.com'
SELECT *
FROM `admin`
WHERE `username` = 'test@gmail.com'
 LIMIT 1