app/Models/api_posts_model.php

SELECT *
FROM `api_posts`
---
    function allData()
    {
        return $this->findAll();