app/Models/Category_model.php

    public function allData()
    {
        return $this->findAll();
---
SELECT *
FROM `category`